app/controllers/comments_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
   @idea = Idea.find(params[:idea_id])

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "idea_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["body", "nice pic"], ["created_at", Tue, 03 Dec 2013 17:20:48 UTC +00:00], ["idea_id", 1], ["updated_at", Tue, 03 Dec 2013 17:20:48 UTC +00:00], ["user_name", "julia"]]
---
  def create
    @idea = Idea.find(params[:idea_id])
	@comment = Comment.new(comment_params)
	@comment.idea = @idea
    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_comment
     @idea = idea.find(params[:idea_id])
     @comment = @idea.comments.find(params[:id])