app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("created_at", "description", "name", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 03 Dec 2013 17:12:12 UTC +00:00], ["description", "geek and girls app"], ["name", "ad"], ["picture", "004.JPG"], ["updated_at", Tue, 03 Dec 2013 17:12:12 UTC +00:00]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save